tutorials/basic/simpleFoam/3D/Array_Parallel_Cylinders_Square_Arrangement/Velocity_X_Direction/system/pressureDifferencePatch2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the difference between the average pressures on 2 specified
    patches.

\*---------------------------------------------------------------------------*/

patch1 wall_effective_z2;
patch2 wall_effective_z1;

#includeEtc "caseDicts/postProcessing/pressure/pressureDifferencePatch.cfg"

// ************************************************************************* //
